#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=e822ed0a-f2f4-40ed-9286-e346b5b77a3c]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=747dd4c8-c0a7-48cd-bcd4-d41e6f80e63e]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b736fc9f-a588-487c-a8d5-f9fedd1cf89f]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a1624ea6-ba03-4982-b59d-0f20423d7ed4]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dbfcfc06-816a-44e9-9729-bbb0dcbd3ac5]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aa1c86d7-f8aa-4714-9926-a58622d1d324]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9ff96311-ac47-4bbe-a054-71ab6f55c023]
module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=48feb877-0c12-4a99-8dec-f6c5d4621a72]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2feb5617-2be9-483d-8ec0-04ecc6deff3f]
module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0b0484a1-58fe-41f6-af04-40822a4db198]
module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=76cc8bdc-2797-4b28-814a-35fc45f12f94]
module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=816ec94d-531f-464b-9b70-f611bfb66571]
module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ad458568-f77f-435c-9885-62a0f285d936]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8f9958b3-f40b-48ae-815e-0fc0271b345b]
module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7192e17a-1d47-473b-a6be-46bf0aa1750a]
module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c888ed95-4139-4a14-9c91-5da21324de83]
module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=98409957-19d8-41ad-bfb8-b863e7d6bd5d]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8b99af0f-993e-46c3-8341-74e3124343db]
module.keycloak_dev.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=15368d53-1b78-46a2-b8f2-8ab8bbfdb82d]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=97184e33-5413-40f5-9404-65ea2afca6c9]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=71146a13-fb16-4606-9d00-a7e021036455]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2a594a06-15d5-4d7c-9fce-8248ab7259ff]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c2e2e710-9f0a-4d10-a63a-3d9926aa5548]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=6c06b7e2-bf26-4fd0-9d9d-abfe6fd9cf57]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=32531f90-040c-44e8-a3cf-5438b59d6ef9]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0ea0dbdb-f06f-48e5-98cd-a4c145cb135a]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1c622f89-6dc9-4879-952a-ddff7b4a5bc4]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=478093b5-1d85-44ee-9290-1dde831f4bb2]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=31513666-47dd-4882-bf62-833188217a03]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
      ~ access_type                              = "PUBLIC" -> "CONFIDENTIAL"
        id                                       = "39739182-1a94-4c27-89d4-9243adad8c6e"
        name                                     = "kuro-mar-07-b-ce-id-basic-test-6370"
      - pkce_code_challenge_method               = "S256" -> null
      ~ valid_redirect_uris                      = [
          + "http://devchange.com",
            # (1 unchanged element hidden)
        ]
      ~ web_origins                              = [
          - "+",
          - "http://bceidDev.com",
        ]
        # (12 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-both-test-6372"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidDev.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidDev.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
      ~ access_type                              = "PUBLIC" -> "CONFIDENTIAL"
        id                                       = "3339b760-2b4b-4ed2-bab2-d6c5c3d1a13c"
        name                                     = "kuro-mar-07-b-ce-id-basic-test-6370"
      - pkce_code_challenge_method               = "S256" -> null
      ~ valid_redirect_uris                      = [
          + "http://testchange.com",
            # (1 unchanged element hidden)
        ]
      ~ web_origins                              = [
          - "+",
          - "http://bceidTest.com",
        ]
        # (11 unchanged attributes hidden)
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-both-test-6372"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidTest.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidTest.com",
        ]
    }

Plan: 20 to add, 2 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 4270 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*